app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    binding.pry
    @post = Post.find_by_id(params[:id])